---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.MaterialParamSmoothness
source: html/dfc5aa7a-3106-a694-f0ce-92fc278e877d.htm
---
# Autodesk.Revit.DB.ParameterTypeId.MaterialParamSmoothness Property

"Smoothness"

## Syntax (C#)
```csharp
public static ForgeTypeId MaterialParamSmoothness { get; }
```